#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/managedkube/kubernetes-ops-staging-30-helm-kube-prometheus-stack/runs/run-qRpP4fgCXa5NptBZ

Waiting for the plan to start...

Terraform v0.15.1
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.kube-prometheus-stack.helm_release.helm_chart will be created
  + resource "helm_release" "helm_chart" {
      + atomic                     = false
      + chart                      = "kube-prometheus-stack"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "kube-prometheus-stack"
      + namespace                  = "monitoring"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                ---
                namespaceOverride: monitoring
                # prometheusOperator:
                #   nodeSelector:
                #     app-type: my-app
                #   tolerations:
                #   - key: "app-type"
                #     operator: "Equal"
                #     value: "my-app"
                #     effect: "NoSchedule"
                # prometheus:
                #   prometheusSpec:
                #     nodeSelector:
                #       app-type: my-app
                #     tolerations:
                #     - key: "app-type"
                #       operator: "Equal"
                #       value: "my-app"
                #       effect: "NoSchedule"
                # alertmanager:
                #   enabled: true
                  # alertmanagerSpec:
                  #   nodeSelector:
                  #     app-type: my-app
                  #   tolerations:
                  #   - key: "app-type"
                  #     operator: "Equal"
                  #     value: "my-app"
                  #     effect: "NoSchedule"
                # nodeExporter:
                  # nodeSelector:
                  #   app-type: my-app
                  # tolerations:
                  # - key: "app-type"
                  #   operator: "Equal"
                  #   value: "my-app"
                  #   effect: "NoSchedule"
                grafana:
                  adminPassword: prom-operator
                  ingress:
                    enabled: true
                    annotations:
                      kubernetes.io/ingress.class: ingress-external
                    hosts:
                    - grafana.kubernetes-ops.com
                  # nodeSelector:
                  #   app-type: my-app
                  # tolerations:
                  # - key: "app-type"
                  #   operator: "Equal"
                  #   value: "my-app"
                  #   effect: "NoSchedule"
            EOT,
          + <<-EOT
                ---
                namespaceOverride: monitoring
                prometheus:
                  prometheusSpec:
                    storageSpec:
                     volumeClaimTemplate:
                       spec:
                        #  storageClassName: gluster
                         accessModes: ["ReadWriteOnce"]
                         resources:
                           requests:
                             storage: 25Gi
                grafana:
                  ingress:
                    enabled: true
                    annotations:
                      kubernetes.io/ingress.class: ingress-external
                    hosts:
                    - grafana.staging.k8s.managedkube.com.com
            EOT,
        ]
      + verify                     = false
      + version                    = "14.5.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>
*Pusher: @sekka1, Action: `pull_request`*